print('Напишите программу, которая принимает на вход две строки, а программа определяет количество вхождений одной строки в другую')

a = input('Введите 1-ую строку: ')
b = input('Введите 2-ую строку: ')
print(b.count(a))



