print('Задача: Задайте последовательность чисел. Напишите программу, которая выведет список')
print('неповторяющихся элементов исходной последовательности')

list1 = [1, 2, 3, 4, 4, 5, 3, 5, 6, 6, 6, 7, 43, 3]
list2 = set(list1)
print(list2)