# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, 
# стоящих на нечётной позиции.
import random

# list1 = [i for i in range(1, 5)]
# list2 = []
# list(filter(lambda x: list2.append(list1[x]), [x for x in range(1, len(list1), 2)]))
# print(list1)
# print(sum(list2))

# print(n)

